xml/Enums/ИИА_ТипДиалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ИИА_ТипДиалога</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Агент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрос1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспознаваниеДокументов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml/Enums/ИИА_АвторСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИИА_АвторСообщения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пользователь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Система</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml/Enums/ИИА_ТипСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ИИА_ТипСообщения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Текст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Код</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml/CommonModules/ИИА_ApprovalPolicy/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ОбработатьApprovalПередExecuteSubgraph(СсылкаДиалога, DSLДляИсполнения, АртефактПлана = Неопределено, ИмяПодграфа = "") Экспорт
	ОценкаРиска = ОценитьРискDSLДляПодтверждения(DSLДляИсполнения);
	Если ИИА_Сервер.ЭтоРежимБезПодтверждения(СсылкаДиалога) Тогда
		ОценкаРиска.requires_approval = Ложь;
		ОценкаРиска.reason = ОценкаРиска.reason + ?(ПустаяСтрока(ОценкаРиска.reason), "", " ") + "Для текущего диалога включен режим выполнения без подтверждения.";
	КонецЕсли;
	Если ЭтоДиалогРаспознаванияДокументов(СсылкаДиалога) Тогда
		ОценкаРиска.requires_approval = Ложь;
		ОценкаРиска.reason = ОценкаРиска.reason + ?(ПустаяСтрока(ОценкаРиска.reason), "", " ") + "Режим распознавания документов создает черновики по skill без отдельного runtime approval.";
	КонецЕсли;
	СостояниеПодтверждения = ИИА_Сервер.ПолучитьСостояниеПодтверждения(СсылкаДиалога);
	Если СостояниеПодтверждения <> Неопределено
		И СостояниеПодтверждения.Свойство("status")
		И ВРег(Строка(СостояниеПодтверждения.status)) = "APPROVED"
		И СостояниеПодтверждения.Свойство("planned_dsl")
		И СокрЛП(Строка(СостояниеПодтверждения.planned_dsl)) = СокрЛП(DSLДляИсполнения) Тогда
		СостояниеПодтверждения.status = "consumed";
		ИИА_Сервер.СохранитьСостояниеПодтверждения(СсылкаДиалога, СостояниеПодтверждения);
		ИИА_Сервер.СохранитьЧекпоинтОркестратора(СсылкаДиалога, "approval_consumed", "Execute", СостояниеПодтверждения, "approval_consumed");
		Возврат Ложь;
	КонецЕсли;
	Если ТребуетсяПодтверждениеПередИсполнением(ОценкаРиска) Тогда
		ЗапроситьПодтверждениеПользователя(СсылкаДиалога, DSLДляИсполнения, ОценкаРиска, АртефактПлана, ИмяПодграфа);
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

Функция ЭтоДиалогРаспознаванияДокументов(СсылкаДиалога)

	Если НЕ ЗначениеЗаполнено(СсылкаДиалога) Тогда
		Возврат Ложь;
	КонецЕсли;
	Попытка
		Возврат СсылкаДиалога.ТипДиалога = Перечисления.ИИА_ТипДиалога.РаспознаваниеДокументов;
	Исключение
		Возврат Ложь;
	КонецПопытки;

КонецФункции

Функция ОценитьРискDSLДляПодтверждения(DSLСценарий) Экспорт
	Результат = Новый Структура("risk_level,reason,requires_approval,actions_preview", "read_safe", "", Ложь, "");
	Если ПустаяСтрока(DSLСценарий) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Попытка
		ТекстJSON = ИИА_DSL.НормализоватьJSONТекст(DSLСценарий);
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТекстJSON);
		Сценарий = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
	Исключение
		Результат.risk_level = "read_expensive";
		Результат.reason = "Невозможно надежно разобрать DSL до исполнения.";
		Результат.requires_approval = Истина;
		Возврат Результат;
	КонецПопытки;
	
	Шаги = Новый Массив;
	Если ТипЗнч(Сценарий) = Тип("Структура") И Сценарий.Свойство("steps") И ТипЗнч(Сценарий.steps) = Тип("Массив") Тогда
		Шаги = Сценарий.steps;
	ИначеЕсли ТипЗнч(Сценарий) = Тип("Структура") И Сценарий.Свойство("action") Тогда
		Шаги.Добавить(Сценарий);
	КонецЕсли;
	
	Действия = Новый Массив;
	ТяжелоеЧтение = Ложь;
	
	Для Каждого Шаг Из Шаги Цикл
		Если ТипЗнч(Шаг) <> Тип("Структура") И ТипЗнч(Шаг) <> Тип("Соответствие") Тогда
			Продолжить;
		КонецЕсли;
		
		Действие = "";
		Если ТипЗнч(Шаг) = Тип("Структура") И Шаг.Свойство("action") Тогда
			Действие = СокрЛП(Строка(Шаг.action));
		ИначеЕсли ТипЗнч(Шаг) = Тип("Соответствие") И Шаг.Получить("action") <> Неопределено Тогда
			Действие = СокрЛП(Строка(Шаг.Получить("action")));
		КонецЕсли;
		Если ПустаяСтрока(Действие) Тогда
			Продолжить;
		КонецЕсли;
		
		Действия.Добавить(Действие);
		Если ЭтоИзменяющееДействиеДляApproval(Действие) Тогда
			Результат.risk_level = "write_or_mutation";
			Результат.reason = "DSL содержит действия изменения данных: " + СтрСоединить(Действия, ", ");
			Результат.requires_approval = Истина;
		КонецЕсли;
		
		Если ВРег(Действие) = "RUNQUERY" Тогда
			ТекстЗапроса = "";
			Если ТипЗнч(Шаг) = Тип("Структура") И Шаг.Свойство("query") Тогда
				ТекстЗапроса = Строка(Шаг.query);
			ИначеЕсли ТипЗнч(Шаг) = Тип("Соответствие") И Шаг.Получить("query") <> Неопределено Тогда
				ТекстЗапроса = Строка(Шаг.Получить("query"));
			КонецЕсли;
			ТекстЗапросаВРег = ВРег(ТекстЗапроса);
			Если СтрДлина(ТекстЗапроса) > 400
				ИЛИ СтрНайти(ТекстЗапросаВРег, " СОЕДИНЕНИЕ ") > 0
				ИЛИ СтрНайти(ТекстЗапросаВРег, " JOIN ") > 0
				ИЛИ СтрНайти(ТекстЗапросаВРег, " ОБЪЕДИНИТЬ ") > 0
				ИЛИ (СтрНайти(ТекстЗапросаВРег, " ИЗ ") > 0
					И СтрНайти(ТекстЗапросаВРег, "ПЕРВЫЕ ") = 0
					И СтрНайти(ТекстЗапросаВРег, " ГДЕ ") = 0) Тогда
				ТяжелоеЧтение = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Результат.actions_preview = СтрСоединить(Действия, ", ");
	Если Результат.risk_level = "write_or_mutation" Тогда
		Возврат Результат;
	КонецЕсли;
	Если ТяжелоеЧтение Тогда
		Результат.risk_level = "read_expensive";
		Результат.reason = "DSL содержит потенциально тяжелый RunQuery.";
		Результат.requires_approval = Истина;
	Иначе
		Результат.risk_level = "read_safe";
		Результат.reason = "DSL не содержит действий записи и не выглядит тяжелым.";
		Результат.requires_approval = Ложь;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ПодтвердитьОжидающееДействие(СсылкаДиалога, АвтоПродолжить = Истина) Экспорт
	Если НЕ ЗначениеЗаполнено(СсылкаДиалога) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СостояниеПодтверждения = ИИА_Сервер.ПолучитьСостояниеПодтверждения(СсылкаДиалога);
	Если СостояниеПодтверждения = Неопределено
		ИЛИ НЕ СостояниеПодтверждения.Свойство("status")
		ИЛИ ВРег(Строка(СостояниеПодтверждения.status)) <> "PENDING" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СостояниеПодтверждения.status = "approved";
	СостояниеПодтверждения.decision = "approve";
	СостояниеПодтверждения.decision_at = ТекущаяДатаСеанса();
	ИИА_Сервер.СохранитьСостояниеПодтверждения(СсылкаДиалога, СостояниеПодтверждения);
	ЗафиксироватьApprovalDecision(СсылкаДиалога, "approved", СостояниеПодтверждения, ?(СостояниеПодтверждения.Свойство("subgraph_name"), Строка(СостояниеПодтверждения.subgraph_name), "ExecuteSubgraph"), "user_approved", "approval_approved", "Execute", "approval_approved", "Пользователь подтвердил выполнение рискованного DSL. Возобновляю оркестратор.");
	Если АвтоПродолжить Тогда
		ИИА_Оркестратор.Запустить(СсылкаДиалога, Истина);
	КонецЕсли;
	Возврат Истина;
КонецФункции

Функция ОтклонитьОжидающееДействие(СсылкаДиалога, АвтоПродолжить = Истина) Экспорт
	Если НЕ ЗначениеЗаполнено(СсылкаДиалога) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СостояниеПодтверждения = ИИА_Сервер.ПолучитьСостояниеПодтверждения(СсылкаДиалога);
	Если СостояниеПодтверждения = Неопределено
		ИЛИ НЕ СостояниеПодтверждения.Свойство("status")
		ИЛИ ВРег(Строка(СостояниеПодтверждения.status)) <> "PENDING" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СостояниеПодтверждения.status = "rejected";
	СостояниеПодтверждения.decision = "reject";
	СостояниеПодтверждения.decision_at = ТекущаяДатаСеанса();
	ИИА_Сервер.СохранитьСостояниеПодтверждения(СсылкаДиалога, СостояниеПодтверждения);
	ЗафиксироватьApprovalDecision(СсылкаДиалога, "rejected", СостояниеПодтверждения, ?(СостояниеПодтверждения.Свойство("subgraph_name"), Строка(СостояниеПодтверждения.subgraph_name), "ExecuteSubgraph"), "user_rejected", "approval_rejected", "Plan", "approval_rejected", "Пользователь отклонил выполнение рискованного DSL. План будет перестроен.");
	
	Если СостояниеПодтверждения.Свойство("step_id") И НЕ ПустаяСтрока(Строка(СостояниеПодтверждения.step_id)) Тогда
		ИИА_TypedPlan.ОбновитьШагПлана(СсылкаДиалога, Строка(СостояниеПодтверждения.step_id), "pending", "Отклонено пользователем, требуется перепланирование");
	КонецЕсли;
	
	Если АвтоПродолжить Тогда
		ИИА_Оркестратор.Запустить(СсылкаДиалога, Истина);
	КонецЕсли;
	Возврат Истина;
КонецФункции

Функция ВключитьРежимБезПодтвержденияИПродолжить(СсылкаДиалога) Экспорт
	Если НЕ ЗначениеЗаполнено(СсылкаДиалога) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИИА_Сервер.УстановитьРежимБезПодтверждения(СсылкаДиалога, Истина);
	ИИА_Сервер.ДобавитьСообщениеВДиалог(СсылкаДиалога, Перечисления.ИИА_АвторСообщения.Система, Перечисления.ИИА_ТипСообщения.Текст, "Для текущего диалога включен режим: выполнять без подтверждения.");
	Возврат ПодтвердитьОжидающееДействие(СсылкаДиалога);
КонецФункции

Функция ЭтоИзменяющееДействиеДляApproval(Действие) Экспорт
	ДействиеВРег = ВРег(СокрЛП(Действие));
	Возврат ДействиеВРег = "CREATEDOCUMENT"
		ИЛИ ДействиеВРег = "CREATEREFERENCE"
		ИЛИ ДействиеВРег = "SETFIELD"
		ИЛИ ДействиеВРег = "WRITE";
КонецФункции

Функция ТребуетсяПодтверждениеПередИсполнением(ОценкаРиска) Экспорт
	Возврат ОценкаРиска <> Неопределено
		И ОценкаРиска.Свойство("requires_approval")
		И ОценкаРиска.requires_approval;
КонецФункции

Функция СформироватьPreviewПодтверждения(DSLСценарий, ОценкаРиска) Экспорт
	Текст = "Требуется подтверждение перед выполнением DSL." + Символы.ПС;
	Если ОценкаРиска <> Неопределено Тогда
		Текст = Текст + "Риск: " + ?(ОценкаРиска.Свойство("risk_level"), Строка(ОценкаРиска.risk_level), "") + Символы.ПС;
		Текст = Текст + "Причина: " + ?(ОценкаРиска.Свойство("reason"), Строка(ОценкаРиска.reason), "") + Символы.ПС;
		Если ОценкаРиска.Свойство("actions_preview") И НЕ ПустаяСтрока(Строка(ОценкаРиска.actions_preview)) Тогда
			Текст = Текст + "Действия: " + Строка(ОценкаРиска.actions_preview) + Символы.ПС;
		КонецЕсли;
	КонецЕсли;
	Текст = Текст + "DSL preview:" + Символы.ПС + Лев(DSLСценарий, 1500);
	Если СтрДлина(DSLСценарий) > 1500 Тогда
		Текст = Текст + Символы.ПС + "...(truncated)";
	КонецЕсли;
	Возврат Текст;
КонецФункции

Процедура ЗафиксироватьApprovalDecision(СсылкаДиалога, Decision, СостояниеПодтверждения, ИмяПодграфа, ПричинаРешения, ВидЧекпоинта, СледующаяСтадия = "", ПричинаСостояния = "", СообщениеВДиалог = "") Экспорт
	ЛокИмяПодграфа = ?(ПустаяСтрока(ИмяПодграфа), "ExecuteSubgraph", ИмяПодграфа);
	Детали = Новый Структура("source,step_id,reason", "approval", ?(СостояниеПодтверждения <> Неопределено И СостояниеПодтверждения.Свойство("step_id"), Строка(СостояниеПодтверждения.step_id), ""), ПричинаРешения);
	Если СостояниеПодтверждения <> Неопределено И СостояниеПодтверждения.Свойство("risk_level") Тогда
		Детали.Вставить("risk_level", Строка(СостояниеПодтверждения.risk_level));
	КонецЕсли;
	ИИА_Сервер.ДобавитьРешениеВDecisionLog(СсылкаДиалога, "approval", Decision, ЛокИмяПодграфа, Детали);
	ИИА_Сервер.СохранитьЧекпоинтОркестратора(СсылкаДиалога, ВидЧекпоинта, ?(ПустаяСтрока(СледующаяСтадия), "AwaitApproval", СледующаяСтадия), СостояниеПодтверждения, ПричинаСостояния);
	Если НЕ ПустаяСтрока(СообщениеВДиалог) Тогда
		ИИА_Сервер.ДобавитьСообщениеВДиалог(СсылкаДиалога, Перечисления.ИИА_АвторСообщения.Система, Перечисления.ИИА_ТипСообщения.Текст, СообщениеВДиалог);
	КонецЕсли;
	Если НЕ ПустаяСтрока(СледующаяСтадия) Тогда
		ИИА_Сервер.УстановитьСостояниеОркестратора(СсылкаДиалога, СледующаяСтадия, ПричинаСостояния, Ложь);
	КонецЕсли;
КонецПроцедуры

Процедура ЗапроситьПодтверждениеПользователя(СсылкаДиалога, DSLСценарий, ОценкаРиска, АртефактПлана, ИмяПодграфа = "") Экспорт
	StepId = ?(АртефактПлана <> Неопределено И АртефактПлана.Свойство("PlanStepId"), Строка(АртефактПлана.PlanStepId), "");
	Preview = СформироватьPreviewПодтверждения(DSLСценарий, ОценкаРиска);
	СостояниеПодтверждения = Новый Структура;
	СостояниеПодтверждения.Вставить("status", "pending");
	СостояниеПодтверждения.Вставить("risk_level", ?(ОценкаРиска.Свойство("risk_level"), ОценкаРиска.risk_level, ""));
	СостояниеПодтверждения.Вставить("reason", ?(ОценкаРиска.Свойство("reason"), ОценкаРиска.reason, ""));
	СостояниеПодтверждения.Вставить("preview", Preview);
	СостояниеПодтверждения.Вставить("planned_dsl", DSLСценарий);
	СостояниеПодтверждения.Вставить("step_id", StepId);
	СостояниеПодтверждения.Вставить("requested_at", ТекущаяДатаСеанса());
	СостояниеПодтверждения.Вставить("decision_at", Неопределено);
	СостояниеПодтверждения.Вставить("decision", "");
	СостояниеПодтверждения.Вставить("subgraph_name", ?(ПустаяСтрока(ИмяПодграфа), "ExecuteSubgraph", ИмяПодграфа));
	ИИА_Сервер.СохранитьСостояниеПодтверждения(СсылкаДиалога, СостояниеПодтверждения);
	ЗафиксироватьApprovalDecision(СсылкаДиалога, "requested", СостояниеПодтверждения, ?(ПустаяСтрока(ИмяПодграфа), "ExecuteSubgraph", ИмяПодграфа), ?(ОценкаРиска.Свойство("reason"), Строка(ОценкаРиска.reason), ""), "approval_requested", "AwaitApproval", "approval_required", Preview);
	ИИА_Оркестратор.ОбновитьСтатусПоследнегоСообщения(СсылкаДиалога, "Ожидает подтверждения пользователя");
КонецПроцедуры

#КонецОбласти
